Simulation-of-Turbulent-Flow-in-a-2D-Channel-in-OpenFOAM-Code-Files/kepsilon/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (65 0 0)
    (0 0.5 0)
    (65 0.5 0)
    (0 1 0)
    (65 1 0)
    (0 0 0.1)
    (65 0 0.1)
    (0 0.5 0.1)
    (65 0.5 0.1)
    (0 1 0.1)
    (65 1 0.1)
);

blocks
(
    hex (0 1 3 2 6 7 9 8) (75 30 1) simpleGrading (1 15.4 1)
    hex (2 3 5 4 8 9 11 10) (75 30 1) simpleGrading (1 0.065 1)
);

edges
(
);

boundary
(
    lowerWall
    {
        type            wall;
        faces           ((0 1 7 6));
    }
    upperWall
    {
        type            wall;
        faces           ((4 10 11 5));
    }
    
    inlet
    {
        type            patch;
        faces           
	(
	      (0 6 8 2)
          (2 8 10 4)
	);
    }
    outlet
    {
        type            patch;
        faces           
	(
	     (1 3 9 7) 
         (3 5 11 9)
	);
    }
    
    frontAndBack
    {
        type            empty;
        faces           
	(
	     (0 2 3 1) 
	     (6 7 9 8) 
	     (2 4 5 3)
	     (8 9 11 10)
	);
    }    
);

mergePatchPairs
(
);

// ************************************************************************* //
