Simulation-of-Turbulent-Flow-in-a-2D-Channel-in-OpenFOAM-Code-Files/kepsilon/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          75;
        startFace       8865;
    }
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          75;
        startFace       8940;
    }
    inlet
    {
        type            patch;
        nFaces          60;
        startFace       9015;
    }
    outlet
    {
        type            patch;
        nFaces          60;
        startFace       9075;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          9000;
        startFace       9135;
    }
)

// ************************************************************************* //
