Simulation-of-Turbulent-Flow-in-a-2D-Channel-in-OpenFOAM-Code-Files/kepsilon/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.41;

boundaryField
{
    inlet
    {
        type        	turbulentIntensityKineticEnergyInlet;
        intensity   	0.0261;          
        value       	$internalField;     
    }
    outlet
    {
        type            zeroGradient;
    }
    upperWall
    {
        type            kqRWallFunction;
        value       	$internalField;
    }
    lowerWall
    {
        type            kqRWallFunction;
        value       	$internalField;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
